app/controllers/instructors_controller.rb

SELECT * FROM `instructors`
---
  def index
    @instructors = Instructor.all

SELECT * FROM `instructors` WHERE (`instructors`.`id` = 1)
---
  def show
    @instructor = Instructor.find(params[:id])

INSERT INTO `instructors` (`name`, `created_at`, `updated_at`, `bio`) VALUES('Ian Tagge', '2010-08-25 03:11:11', '2010-08-25 03:11:11', 'Ian is a badass instructor')
---
  def create
    @instructor = Instructor.new(params[:instructor])
    @instructor.user << current_user