app/controllers/studios_controller.rb

  def index
    @studios = Studio.find_studios
    @usr = current_user
    @usrs = User.all
---
SELECT * FROM `studios` WHERE (`studios`.user_id = 4) ORDER BY name
SELECT * FROM `users`

  def show
    @studio = Studio.find(params[:id])
---
SELECT * FROM `studios` WHERE (`studios`.`id` = 1)

  def edit
    @studio = Studio.find(params[:id])
---
SELECT * FROM `studios` WHERE (`studios`.`id` = 1)

  def create
    @studio = Studio.new(params[:studio])
    @studio.user = current_user

    respond_to do |format|
      if @studio.save
---
INSERT INTO `studios` (`name`, `address`, `city`, `created_at`, `zip_code`, `updated_at`, `phone`, `description`, `state`, `email`) VALUES('Core Power Yoga', '2277 NW Quimby St', 'Portland', '2010-08-24 21:22:55', '97210', '2010-08-24 21:22:55', '503.226.9642', 'CorePower Yoga Portland is a unique and thriving community located in the beautiful Northwest District of Portland, Oregon. We strive to welcome all students of life, at all levels of yoga practice. The eclectic vibe of this city is reflected in passionate yoga instructors with styles spun to suit all yogis.\r\n \r\nCorePower Yoga Portland offers CorePower Vinyasa, Hot Yoga and Hot Power Fusion. Power and Hot Yoga are invigorating and light us to a deeper path of awakening. Our studio provides yoga classes starting at 6am and the last class is offered at 7pm.\r\n \r\nOur boutique hours are from 8am to 8pm, including beautiful, high performance yoga and street wear for men and women. We also sell yoga mats, accessories and resourceful books to deepen each yoga pupil\'s growth.\r\n \r\nCorePower Yoga Portland is perfect for the athlete who surfs, cycles, skis and hikes in this tropical, mountainous Mecca.\r\n \r\nJoin us as you watch your yoga practice unfold.', 'Oregon', 'membership@corepoweryoga.com')

  def update
    @studio = Studio.find(params[:id])

    respond_to do |format|
      if @studio.update_attributes(params[:studio])
---
SELECT * FROM `studios` WHERE (`studios`.`id` = 1)
UPDATE `studios` SET `updated_at` = '2010-09-16 15:44:01', `style` = 'Vinyasa, Qi Gong, Sivananda' WHERE `id` = 1