app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `studio_id`, `remember_token`, `login`, `email`) VALUES('', '1a37d5fb130385e347556bae6fbad855b954a55d', '2010-09-16 14:59:04', NULL, '5432aeb6492c350ab4cf752b790abe02b883a973', NULL, '2010-09-16 14:59:04', '5629bcd36c9f6a2be1ddb4c193ac3a806376a40d', NULL, NULL, 'ian', 'ian.tagge@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.activate!
    success = @user && @user.save