app/controllers/yoga_classes_controller.rb

SELECT * FROM `yoga_classes`
---
  def index
    @yoga_classes = YogaClass.all

SELECT * FROM `yoga_classes` WHERE (`yoga_classes`.`id` = 1)
---
  def show
    @yoga_class = YogaClass.find(params[:id])

INSERT INTO `yoga_classes` (`name`, `created_at`, `updated_at`, `level`, `studio_id`, `description`, `type_of`) VALUES('$8 -Hot Power Fusion', '2010-08-24 21:30:29', '2010-08-24 21:30:29', 'Beginner', 1, 'This class is eight dollars only! Join us as we introduce this new flow to CorePower Yoga, Portland. Hot Power Fusion is a rigorous blend of Hot and Power Yoga. It encompasses the meditative quality of Hot yoga with the intensity of power yoga. Focus is on opening the shoulders, hips and spine as well as strengthening core and upper body. It rinses the mind and soul.', 'Bikram')
---
  def create
    @yoga_class = YogaClass.new(params[:yoga_class])
    @yoga_class.studio = current_user.studio

    respond_to do |format|
      if @yoga_class.save