app/controllers/yoga_workshops_controller.rb

  def index
    @yoga_workshops = YogaWorkshop.all
---
SELECT * FROM `yoga_workshops`